InformationRegisters/ЛБ_СостояниеОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолгаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыКорректировкиНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКорректировкиНакладной</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВключитьЗБВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключениеЗБИзНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаВключенияЗБВНакладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаНакладных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОтгрузкиНакладных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтгруженногоЗБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выкуплен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВостребован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятНаСкладСумка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаОплатыОтгруженныхЗБ/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
	    Документ = Параметры.Документ; 
		Если Документ.Проведен тогда
		   СостояниеДокумента = 1;
		ИначеЕсли Документ.ПометкаУдаления тогда
		   СостояниеДокумента = 2;
        КонецЕсли;
		ЗаполнитьСписокЗБПоДокументу();
		ЗаполнитьТаблицу();
		Элементы.ГруппаДокумент.Видимость = Истина; 
		Элементы.ГруппаДокументПодвал.Видимость = Истина;
		Элементы.ДекорацияВключить.Видимость = Ложь;  
		Элементы.ТаблицаВыбора.КоманднаяПанель.Видимость = ложь; 
		Элементы.ТаблицаВыбораВкл.Видимость = Ложь;  
		ЭтаФорма.Заголовок = Метаданные.Документы.ЛБ_КорректировкаНакладной.Синоним + ": " + Строка(Документ.ВидОперации);
		Если Документ.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОплатаОтгруженногоЗБ Тогда  
			Если НЕ ТаблицаВыбора.Количество() = 0 Тогда
				Если ТаблицаВыбора.Получить(0).ДатаОплаты  < НачалоДня(ТекущаяДатаСеанса()) Тогда
		            ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " (Архив)";    
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	Иначе
		Если Параметры.Свойство("Организация") Тогда 
			Организация = Параметры.Организация; 
		КонецЕсли;	
		ИнформацияДляПользователя(); 
		ЭтаФорма.Заголовок = "Согласование оплаты отгруженных ЗБ";
	КонецЕсли;	
КонецПроцедуры	

 &НаСервере
Процедура ЗаполнитьСписокЗБПоДокументу()
	СписокЗБ.Очистить();
	Для каждого стр Из Документ.ЗалоговыеБилеты Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ИнформацияДляПользователя() 
	Если ТаблицаВыбора.Количество() = 0 тогда 
		Элементы.ДекорацияВключить.Заголовок = "Не выбраны залоговые билеты для выкупа."; 
	Иначе   
		Отбор = новый Структура;
		Отбор.Вставить("Вкл", Истина);
		Строки = ТаблицаВыбора.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 тогда 
		    Элементы.ДекорацияВключить.Заголовок = "Не выбраны залоговые билеты для выкупа.";
		Иначе  
			Элементы.ДекорацияВключить.Заголовок = "Выбрано залоговых билетов для выкупа " + Строка(Строки.Количество()) + ".";
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	
	 
&НаКлиенте
Процедура ВыбратьЗБ(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", ЭтаФорма.Организация);
    ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗБ", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЗалоговыхБилетов", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Функция ПроверитьЕстьЗалогиВключенныеВРеализацию(ЗБ)
	СтрокаСообщения = "";
	ЗапросЗБ = Новый Запрос;
	ЗапросЗБ.УстановитьПараметр("ЗБ", ЗБ);  
	ЗапросЗБ.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Документ), Документ.Дата, ТекущаяДатаСеанса()));
	ЗапросЗБ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗБ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";         
	ТаблицаЗапроса = ЗапросЗБ.Выполнить().Выгрузить();
	ТаблицаЗБ = ТаблицаЗапроса.Скопировать(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");
	Для каждого СтрЗБ Из ТаблицаЗБ Цикл   
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", СтрЗБ.ЗалоговыйБилет);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Для каждого Стр Из строки Цикл
			Если Стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован ИЛИ Стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят тогда 
				Продолжить;
			КонецЕсли;
			РезультатПроверки = ЛБ_УправлениеЛомбардом.ПроверитьОбъектЗалогаДобавленВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
			Если НЕ РезультатПроверки = неопределено Тогда 
				Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(ТекущаяДатаСеанса(), Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
				СтрокаСообщения = СтрокаСообщения + ?(ПустаяСтрока(СтрокаСообщения), "", ", ") + СокрЛП(Артикул);
            КонецЕсли;
		Конеццикла;	
	Конеццикла;
	Возврат СтрокаСообщения;
КонецФункции      

&НаСервере
Функция ПолучитьЗалогиДляВыкупа(ЗБ)
	СтрокаСообщения = "";
	ЗапросЗБ = Новый Запрос;
	ЗапросЗБ.УстановитьПараметр("ЗБ", ЗБ);  
	ЗапросЗБ.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Документ), Документ.Дата, ТекущаяДатаСеанса()));
	ЗапросЗБ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗБ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";         
	ТаблицаЗапроса = ЗапросЗБ.Выполнить().Выгрузить();
	ТаблицаЗБ = ТаблицаЗапроса.Скопировать(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");
	Для каждого СтрЗБ Из ТаблицаЗБ Цикл   
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", СтрЗБ.ЗалоговыйБилет);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Для каждого Стр Из строки Цикл
			Если Стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован ИЛИ Стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят тогда
				Продолжить;
			КонецЕсли;
			Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(ТекущаяДатаСеанса(), Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
			СтрокаСообщения = СтрокаСообщения + ?(ПустаяСтрока(СтрокаСообщения), "", ", ") + СокрЛП(Артикул);
   		Конеццикла;	
	Конеццикла;
	Возврат СтрокаСообщения;
КонецФункции  


&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СписокЗБ", СписокЗБ); 
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Документ), Документ.Дата-1, ТекущаяДатаСеанса()));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
	Для каждого Стр Из ТаблицаЗапроса цикл
		НоваяСтр = ТаблицаВыбора.Добавить();
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
		НоваяСтр.СтатусЗБ = Стр.СтатусЗалоговогоБилета;  
		Если ЗначениеЗаполнено(Документ) Тогда 
			Отбор = Новый структура; 
			Отбор.Вставить("ЗалоговыйБилет", НоваяСтр.ЗалоговыйБилет); 
			
			СтрокиДок = Документ.ЗалоговыеБилеты.НайтиСтроки(Отбор);
			Если НЕ СтрокиДок.Количество() = 0 Тогда 
				СтрДок = строкиДок.Получить(0);  
				НоваяСтр.ДатаОплаты = СтрДок.ДатаОплаты;  
				НоваяСтр.Основание = СтрДок.ОснованиеОплаты;
			КонецЕсли;	
		КонецЕсли;	 
		НоваяСтр.Вкл = Истина;   
			
		Если НЕ НоваяСтр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда
			НоваяСтр.Вкл = Ложь;        
			НоваяСтр.Информация = "Залоговый билет не в статусе ""Отгружен""!"; 	
		Иначе
			СтрокаИнф = ПроверитьЕстьЗалогиВключенныеВРеализацию(НоваяСтр.ЗалоговыйБилет);
			Если НЕ ПустаяСтрока(СтрокаИнф) Тогда
				НоваяСтр.Вкл = Ложь;
				НоваяСтр.Информация = "Есть объекты залога включенные в реализацию: " + СтрокаИнф + "!";
			Иначе
				СтрокаИнф = ПолучитьЗалогиДляВыкупа(НоваяСтр.ЗалоговыйБилет);
				Если ПустаяСтрока(СтрокаИнф) Тогда
					НоваяСтр.Вкл = Ложь;
				    НоваяСтр.Информация = "У залогового билета нет изделий для выкупа!";
				Иначе	
				    НоваяСтр.Информация = СтрокаИнф; 
				КонецЕсли;   
			КонецЕсли;	
		КонецЕсли;   
	Конеццикла;	
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	СписокЗБ = Результат; 
	ЗаполнитьТаблицу();  
	ИнформацияДляПользователя();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировку(Команда)
	ЕстьОплаты = Истина;
	Для каждого стр Из ТаблицаВыбора Цикл    
		Если Стр.Вкл Тогда
			Если НЕ ЗначениеЗаполнено(Стр.ДатаОплаты) Тогда
				ЕстьОплаты = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	   
	Если НЕ ЕстьОплаты Тогда 
		Предупреждение("Для все выбранных залоговых билетов нужно заполнить предельные сроки выкупа!"); 
		Возврат;
	КонецЕсли;	

	СписокЗБВключить = Новый СписокЗначений; 
	СписокДаты = Новый СписокЗначений;
	СписокОснования = Новый СписокЗначений;
	Для каждого стр Из ТаблицаВыбора Цикл    
		Если Стр.Вкл Тогда
			СписокЗБВключить.Добавить(Стр.ЗалоговыйБилет);  
			СписокДаты.Добавить(Стр.ДатаОплаты);
			СписокОснования.Добавить(Стр.Основание);
		КонецЕсли;	
	КонецЦикла;	
	Если СписокЗБВключить.Количество() = 0 Тогда
		Предупреждение("Не выбраны залоговые билеты!");    
	Иначе      
		СтруктураВозврата = Новый Структура;  
		СтруктураВозврата.Вставить("СписокЗБ", СписокЗБВключить); 
		СтруктураВозврата.Вставить("СписокДаты", СписокДаты);  
		СтруктураВозврата.Вставить("СписокОснования", СписокОснования);
		Закрыть(СтруктураВозврата);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя(Идентификатор) 
	Стр = ТаблицаВыбора.НайтиПоИдентификатору(Идентификатор);
	Возврат Стр.ЗалоговыйБилет.Залогодатель;
КонецФункции	
	
&НаКлиенте
Процедура ИсторияЗалоговогоБилета(Команда)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		Залогодатель = ПолучитьЗалогодателя(ТекСтрока.ПолучитьИдентификатор());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеДатыОплаты(ДатаОплаты) 		
	Для Каждого Стр Из ТаблицаВыбора Цикл  
		Стр.ДатаОплаты = ДатаОплаты;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораДатаОплатыПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;	
	ОбработатьИзменениеДатыОплаты(ТекСтрока.ДатаОплаты);
КонецПроцедуры
